#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
aws_ecs_task_definition.Task_Dev: Refreshing state... [id=Exam-Dev-APP]
aws_lb_target_group.VPC_Dev_Target_Group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:068379437484:targetgroup/Exam-20211020195529622100000001/e97e3ac66c89e02d]
aws_lb_listener.VPC_Dev_Load_Balancer_Listener_9090: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:068379437484:listener/app/Exam-20211020193947325400000007/39171bb43a662e7e/d319bc2ea43005fe]
aws_ecs_service.VPC_ECS_Service_Dev: Refreshing state... [id=arn:aws:ecs:eu-central-1:068379437484:service/Exam-Cluster/Exam-Dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.VPC_ECS_Service_Dev will be updated in-place
  ~ resource "aws_ecs_service" "VPC_ECS_Service_Dev" {
        id                                 = "arn:aws:ecs:eu-central-1:068379437484:service/Exam-Cluster/Exam-Dev"
        name                               = "Exam-Dev"
        tags                               = {
            "Environment" = "Exam"
            "Name"        = "Exam-Dev ECS Service"
            "Owner"       = "Rainbow Gravity"
            "Project"     = "Template Homework"
        }
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:068379437484:task-definition/Exam-Dev-APP:7" -> (known after apply)
        # (13 unchanged attributes hidden)




        # (5 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.Task_Dev must be replaced
-/+ resource "aws_ecs_task_definition" "Task_Dev" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:068379437484:task-definition/Exam-Dev-APP:7" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - environment  = [] -> null
                  ~ image        = "068379437484.dkr.ecr.eu-central-1.amazonaws.com/golang-app-dev:d85fbef56d28b19fce4b03019c74cf3f938ed824" -> "068379437484.dkr.ecr.eu-central-1.amazonaws.com/python-app-dev:de3e15f36a82b37e3422f2646886ef53f0b297bb"
                  - mountPoints  = [] -> null
                  - volumesFrom  = [] -> null
                    # (5 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "Exam-Dev-APP" -> (known after apply)
      + network_mode             = (known after apply)
      - requires_compatibilities = [] -> null
      ~ revision                 = 7 -> (known after apply)
        tags                     = {
            "Environment" = "Exam"
            "Name"        = "Exam-Dev ECS Task"
            "Owner"       = "Rainbow Gravity"
            "Project"     = "Template Homework"
        }
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @Sturmschwalbe84, Action: `pull_request`, Workflow: `Production env`*